groupmates = [
    {
        "name": "Александр",
        "surname": "Иванов",
        "exams": ["Информатика", "ЭЭиС", "Web"],
        "marks": [4, 3, 5]
    },
    {
        "name": "Иван",
        "surname": "Петров",
        "exams": ["История", "АиГ", "КТП"],
        "marks": [4, 4, 4]
    },
    {
        "name": "Кирилл",
        "surname": "Смирнов",
        "exams": ["Философия", "ИС", "КТП"],
        "marks": [5, 5, 5]
    },
	   {
        "name": "Алексей",
        "surname": "Алексеевич",
        "exams": ["Философия", "ИС", "КТП"],
        "marks": [3, 4, 3]
    },
	   {
        "name": "Ирина",
        "surname": "Викторовна",
        "exams": ["География", "ИС", "КТП"],
        "marks": [3, 2,1]
    }
]
